Tekla Open API Reference for Tekla Structures 2025
WpfComponentCatalog Methods
The WpfComponentCatalog type exposes the following members.
Methods
Name | Description
InitializeComponent
 InitializeComponent
Top
See Also
Reference
WpfComponentCatalog Class
Tekla.Structures.Dialog.UIControls Namespace